[
  {
    "id": 1,
    "name": "Andromeda",
    "abbreviation": "And",
    "genitive": "Andromedae",
    "type": "northern",
    "area_sq_deg": 722,
    "brightest_star": "Alpheratz",
    "brightest_star_magnitude": 2.06,
    "number_of_main_stars": 18,
    "number_of_stars_with_planets": 3,
    "messier_objects": ["M31", "M32", "M110"],
    "visible_latitude_range": "-40° to +90°",
    "best_visible_month": "November",
    "description": "Andromeda is a northern constellation located near the celestial equator, bordered by Cassiopeia, Pegasus, and Perseus. Its most famous deep-sky object is the Andromeda Galaxy (M31), the nearest spiral galaxy to the Milky Way, visible to the naked eye under dark skies. Mythologically, Andromeda represents the princess chained to a rock to be sacrificed to a sea monster, rescued by Perseus. Observers can trace the main stars forming a distinct chain and enjoy galaxy observation using binoculars or a small telescope. Notable stars include Alpheratz (Alpha Andromedae) and Mirach (Beta Andromedae)."
  },
  {
    "id": 2,
    "name": "Antlia",
    "abbreviation": "Ant",
    "genitive": "Antliae",
    "type": "southern",
    "area_sq_deg": 239,
    "brightest_star": "Alpha Antliae",
    "brightest_star_magnitude": 4.25,
    "number_of_main_stars": 3,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "April",
    "description": "Antlia is a faint southern constellation representing an air pump, located south of Hydra and north of Pyxis. It is relatively obscure with no particularly bright stars, though Alpha Antliae is the most prominent at magnitude 4.25. The constellation contains a few small galaxies observable with medium telescopes. Introduced in the 18th century by Nicolas-Louis de Lacaille, Antlia reflects the era's fascination with scientific instruments. Its low brightness makes it a challenge for casual stargazers, so dark skies are recommended for observation."
  },
  {
    "id": 3,
    "name": "Apus",
    "abbreviation": "Aps",
    "genitive": "Apodis",
    "type": "southern",
    "area_sq_deg": 206,
    "brightest_star": "Alpha Apodis",
    "brightest_star_magnitude": 3.83,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to 10°",
    "best_visible_month": "July",
    "description": "Apus is a southern constellation representing the bird of paradise, located near Triangulum Australe and Chamaeleon. It is small and faint, with the brightest star Alpha Apodis barely visible to the naked eye in good conditions. No Messier objects are located here, but some distant galaxies can be seen through telescopes. Apus was named by Dutch navigators in the late 16th century and symbolizes exotic fauna of the Southern Hemisphere. Best viewed in mid-winter months of the southern skies, it is appreciated mainly by enthusiasts seeking to complete all 88 constellations."
  },
  {
    "id": 4,
    "name": "Aquarius",
    "abbreviation": "Aqr",
    "genitive": "Aquarii",
    "type": "southern",
    "area_sq_deg": 980,
    "brightest_star": "Beta Aquarii",
    "brightest_star_magnitude": 2.91,
    "number_of_main_stars": 11,
    "number_of_stars_with_planets": 8,
    "messier_objects": ["M2", "M72", "M73"],
    "visible_latitude_range": "-90° to +65°",
    "best_visible_month": "October",
    "description": "Aquarius, one of the largest constellations, represents the water-bearer and lies in the celestial region known as the Sea due to many water-themed constellations nearby. Its notable stars include Beta Aquarii (Sadalsuud) and Alpha Aquarii (Sadalmelik). Aquarius hosts several interesting deep-sky objects, such as the globular cluster M2 and the planetary grouping M73. Historically, it was associated with various water deities across cultures, including the Greek Ganymede myth. Observing Aquarius is best done during autumn months in both hemispheres, under dark skies, as its stars are relatively faint."
  },
  {
    "id": 5,
    "name": "Aquila",
    "abbreviation": "Aql",
    "genitive": "Aquilae",
    "type": "northern",
    "area_sq_deg": 652,
    "brightest_star": "Altair",
    "brightest_star_magnitude": 0.77,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 5,
    "messier_objects": [],
    "visible_latitude_range": "-75° to +90°",
    "best_visible_month": "August",
    "description": "Aquila is a prominent northern constellation representing the eagle, lying along the Milky Way near Cygnus and Sagittarius. Altair, one of the closest bright stars to Earth, forms part of the Summer Triangle with Deneb and Vega. Aquila contains several double stars and open clusters visible with amateur telescopes. In mythology, the eagle carried Zeus' thunderbolts. Best viewed in late summer evenings, the constellation’s main stars form a striking line, making it easy for observers to identify in the Milky Way’s rich star fields."
  },
  {
    "id": 6,
    "name": "Ara",
    "abbreviation": "Ara",
    "genitive": "Arae",
    "type": "southern",
    "area_sq_deg": 237,
    "brightest_star": "Beta Arae",
    "brightest_star_magnitude": 2.85,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +25°",
    "best_visible_month": "July",
    "description": "Ara, the altar, is a small southern constellation located near Scorpius and Triangulum Australe. Its brightest star, Beta Arae, is an orange giant of magnitude 2.85. The constellation contains several small star clusters observable with amateur telescopes. Historically, it represented the altar where the gods made offerings in Greek mythology. Ara is best seen in winter months of the Southern Hemisphere and is a favorite among constellation completists due to its relative obscurity and southern position."
  },
  {
    "id": 7,
    "name": "Aries",
    "abbreviation": "Ari",
    "genitive": "Arietis",
    "type": "northern",
    "area_sq_deg": 441,
    "brightest_star": "Hamal",
    "brightest_star_magnitude": 2.00,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 3,
    "messier_objects": [],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "December",
    "description": "Aries, representing the ram, is a northern zodiac constellation situated between Pisces and Taurus. Its main stars, Hamal, Sheratan, and Mesarthim, define a simple arc. Aries contains a few faint galaxies observable with telescopes. In Greek mythology, it represents the golden ram that rescued Phrixus and Helle. Zodiac enthusiasts often track the Sun’s passage through Aries during March, marking the vernal equinox. Observing in winter evenings offers clear views of its modest star pattern."
  },
  {
    "id": 8,
    "name": "Auriga",
    "abbreviation": "Aur",
    "genitive": "Aurigae",
    "type": "northern",
    "area_sq_deg": 657,
    "brightest_star": "Capella",
    "brightest_star_magnitude": 0.08,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 7,
    "messier_objects": ["M36", "M37", "M38"],
    "visible_latitude_range": "-50° to +90°",
    "best_visible_month": "February",
    "description": "Auriga, the charioteer, is a prominent northern constellation with the bright star Capella, one of the brightest in the night sky. It contains several open clusters including M36, M37, and M38, which are popular targets for amateur astronomers. Historically linked to the mythological charioteer Erichthonius, Auriga is easily spotted due to its pentagon shape. Best observed during winter months, its bright stars stand out against the Milky Way backdrop, making it suitable for naked-eye and telescopic observations."
  },
  {
    "id": 9,
    "name": "Boötes",
    "abbreviation": "Boo",
    "genitive": "Boötis",
    "type": "northern",
    "area_sq_deg": 907,
    "brightest_star": "Arcturus",
    "brightest_star_magnitude": -0.05,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 9,
    "messier_objects": ["M3"],
    "visible_latitude_range": "-50° to +90°",
    "best_visible_month": "May",
    "description": "Boötes, the herdsman, is a northern constellation located near Virgo and Corona Borealis. Its most notable star, Arcturus, is the fourth-brightest star in the sky and an orange giant. Boötes contains the bright globular cluster M3, observable with small telescopes. The constellation has been associated with agricultural myths and pastoral imagery across cultures. Best seen in spring, Boötes’ distinctive kite shape helps in identifying it among surrounding stars."
  },
  {
    "id": 10,
    "name": "Caelum",
    "abbreviation": "Cae",
    "genitive": "Caeli",
    "type": "southern",
    "area_sq_deg": 125,
    "brightest_star": "Alpha Caeli",
    "brightest_star_magnitude": 4.45,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "December",
    "description": "Caelum is a faint southern constellation representing the engraver’s chisel, located near Eridanus and Dorado. It contains few stars brighter than magnitude 5, with Alpha Caeli being the brightest at 4.45. Caelum has no Messier objects but includes some distant galaxies visible with medium telescopes. Introduced in the 18th century by Nicolas-Louis de Lacaille, Caelum is an example of a modern constellation reflecting scientific instruments. Observers should use dark skies to view its subtle pattern."
  },
  {
    "id": 11,
    "name": "Camelopardalis",
    "abbreviation": "Cam",
    "genitive": "Camelopardalis",
    "type": "northern",
    "area_sq_deg": 757,
    "brightest_star": "Beta Camelopardalis",
    "brightest_star_magnitude": 4.03,
    "number_of_main_stars": 8,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-10° to +90°",
    "best_visible_month": "February",
    "description": "Camelopardalis is a faint northern constellation representing a giraffe, located near Ursa Major and Cassiopeia. It lacks bright stars, with Beta Camelopardalis being the most prominent at magnitude 4.03. Although it contains no Messier objects, several small galaxies are observable with telescopes. Introduced in the early 17th century, its purpose was to fill a large empty area of the northern sky. Best viewed during winter months, Camelopardalis is mainly appreciated by astronomy enthusiasts completing the 88 constellations."
  },
  {
    "id": 12,
    "name": "Cancer",
    "abbreviation": "Cnc",
    "genitive": "Cancri",
    "type": "northern",
    "area_sq_deg": 506,
    "brightest_star": "Beta Cancri",
    "brightest_star_magnitude": 3.5,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 6,
    "messier_objects": ["M44", "M67"],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "March",
    "description": "Cancer, the crab, is a small zodiac constellation situated between Gemini and Leo. It is faint overall, with Beta Cancri as the brightest star. Deep-sky objects include the Beehive Cluster (M44), one of the closest open clusters, and M67, a rich cluster used to study stellar evolution. Mythologically, Cancer represents the crab sent by Hera to distract Hercules during his battle with the Hydra. Best seen in early spring, its subtle stars require dark skies for observation."
  },
  {
    "id": 13,
    "name": "Canes Venatici",
    "abbreviation": "CVn",
    "genitive": "Canum Venaticorum",
    "type": "northern",
    "area_sq_deg": 465,
    "brightest_star": "Cor Caroli",
    "brightest_star_magnitude": 2.9,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 2,
    "messier_objects": ["M3", "M51"],
    "visible_latitude_range": "-40° to +90°",
    "best_visible_month": "May",
    "description": "Canes Venatici, the hunting dogs, is a northern constellation located below Ursa Major. Its brightest star, Cor Caroli, is easily visible in dark skies. The constellation contains notable deep-sky objects such as the globular cluster M3 and the Whirlpool Galaxy (M51). Created by Johannes Hevelius in the 17th century, it represents the dogs of Boötes the herdsman. Spring evenings offer the best viewing, and amateur astronomers often use small telescopes to explore its clusters and galaxies."
  },
  {
    "id": 14,
    "name": "Canis Major",
    "abbreviation": "CMa",
    "genitive": "Canis Majoris",
    "type": "southern",
    "area_sq_deg": 380,
    "brightest_star": "Sirius",
    "brightest_star_magnitude": -1.46,
    "number_of_main_stars": 8,
    "number_of_stars_with_planets": 4,
    "messier_objects": ["M41"],
    "visible_latitude_range": "-90° to +60°",
    "best_visible_month": "January",
    "description": "Canis Major, the great dog, is a southern constellation famous for Sirius, the brightest star in the night sky. Located near Orion, it also contains the open cluster M41. Mythologically, Canis Major represents one of Orion's hunting dogs. Observers in both hemispheres can identify its bright stars forming a distinct pattern extending from Orion. Best viewed during winter, the constellation is prominent in the southern sky and ideal for stargazing and astrophotography."
  },
  {
    "id": 15,
    "name": "Canis Minor",
    "abbreviation": "CMi",
    "genitive": "Canis Minoris",
    "type": "northern",
    "area_sq_deg": 183,
    "brightest_star": "Procyon",
    "brightest_star_magnitude": 0.34,
    "number_of_main_stars": 2,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-75° to +90°",
    "best_visible_month": "March",
    "description": "Canis Minor, the lesser dog, is a small northern constellation notable for Procyon, part of the Winter Triangle with Sirius and Betelgeuse. The constellation contains only a few main stars but serves as a key reference point in winter sky navigation. In mythology, it represents Orion’s smaller hunting companion. Best viewed in late winter and early spring, Canis Minor is easily identified by its bright primary star and sparse accompanying stars."
  },
  {
    "id": 16,
    "name": "Capricornus",
    "abbreviation": "Cap",
    "genitive": "Capricorni",
    "type": "southern",
    "area_sq_deg": 414,
    "brightest_star": "Deneb Algedi",
    "brightest_star_magnitude": 2.85,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 7,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +60°",
    "best_visible_month": "September",
    "description": "Capricornus, the sea-goat, is a zodiac constellation in the southern sky, bordered by Aquarius and Sagittarius. Its brightest star, Deneb Algedi, marks the goat’s tail. Capricornus has a rich history in Babylonian and Greek mythology, symbolizing the god Pan’s transformation into a goat-fish. The constellation is faint but forms a recognizable triangular shape. Best observed in late summer and early autumn, Capricornus offers dark-sky observers an opportunity to track zodiacal constellations and study surrounding faint stars."
  },
  {
    "id": 17,
    "name": "Carina",
    "abbreviation": "Car",
    "genitive": "Carinae",
    "type": "southern",
    "area_sq_deg": 494,
    "brightest_star": "Canopus",
    "brightest_star_magnitude": -0.74,
    "number_of_main_stars": 11,
    "number_of_stars_with_planets": 5,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "March",
    "description": "Carina, the keel, is a prominent southern constellation containing Canopus, the second-brightest star in the sky. Once part of the larger Argo Navis constellation, Carina was subdivided by Lacaille. It hosts several notable star clusters and nebulae, including the famous Eta Carinae system. Carina is best observed from the Southern Hemisphere during late summer to early autumn. Its bright stars make it an easy guide for exploring the rich southern Milky Way."
  },
  {
    "id": 18,
    "name": "Cassiopeia",
    "abbreviation": "Cas",
    "genitive": "Cassiopeiae",
    "type": "northern",
    "area_sq_deg": 598,
    "brightest_star": "Schedar",
    "brightest_star_magnitude": 2.24,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 3,
    "messier_objects": ["M103"],
    "visible_latitude_range": "-20° to +90°",
    "best_visible_month": "November",
    "description": "Cassiopeia is a well-known northern constellation, easily recognizable by its distinctive 'W' shape. Located opposite the Big Dipper across Polaris, it lies near Cepheus and Andromeda. Its brightest star, Schedar, anchors the 'W'. Cassiopeia contains the open cluster M103 and several other clusters. In mythology, it represents Queen Cassiopeia, mother of Andromeda. Best viewed in autumn evenings, it serves as an excellent orientation point for star-hopping and locating nearby deep-sky objects."
  },
  {
    "id": 19,
    "name": "Centaurus",
    "abbreviation": "Cen",
    "genitive": "Centauri",
    "type": "southern",
    "area_sq_deg": 1060,
    "brightest_star": "Alpha Centauri",
    "brightest_star_magnitude": -0.27,
    "number_of_main_stars": 11,
    "number_of_stars_with_planets": 15,
    "messier_objects": ["Omega Centauri"],
    "visible_latitude_range": "-90° to +25°",
    "best_visible_month": "May",
    "description": "Centaurus is a large southern constellation representing the centaur, located near Crux and Hydra. Its brightest star, Alpha Centauri, is the closest stellar system to the Sun. Omega Centauri, the largest globular cluster in the Milky Way, resides within Centaurus. In mythology, it represents Chiron, the wise centaur. Best seen during late autumn in the Southern Hemisphere, Centaurus offers stunning opportunities for observing bright stars, binary systems, and globular clusters."
  },
  {
    "id": 20,
    "name": "Cepheus",
    "abbreviation": "Cep",
    "genitive": "Cephei",
    "type": "northern",
    "area_sq_deg": 588,
    "brightest_star": "Alderamin",
    "brightest_star_magnitude": 2.45,
    "number_of_main_stars": 8,
    "number_of_stars_with_planets": 2,
    "messier_objects": [],
    "visible_latitude_range": "-10° to +90°",
    "best_visible_month": "September",
    "description": "Cepheus is a northern constellation shaped like a house, situated near Cassiopeia and the North Celestial Pole. Its brightest star, Alderamin, serves as a key reference for navigating northern skies. Cepheus contains several variable stars and deep-sky objects suitable for small telescopes. Mythologically, it represents the king of Ethiopia, husband of Cassiopeia and father of Andromeda. Best viewed in early autumn, Cepheus is an ideal target for amateur astronomers exploring northern constellations."
  },
  {
    "id": 21,
    "name": "Cetus",
    "abbreviation": "Cet",
    "genitive": "Ceti",
    "type": "southern",
    "area_sq_deg": 1231,
    "brightest_star": "Diphda",
    "brightest_star_magnitude": 2.04,
    "number_of_main_stars": 14,
    "number_of_stars_with_planets": 4,
    "messier_objects": ["M77"],
    "visible_latitude_range": "-90° to +70°",
    "best_visible_month": "November",
    "description": "Cetus, the sea monster or whale, is a large southern constellation located between Pisces, Aquarius, and Eridanus. Its brightest star, Diphda (Beta Ceti), is an orange giant of magnitude 2.04. Cetus hosts the notable spiral galaxy M77 and several variable stars. Mythologically, it represents the monster sent to devour Andromeda in Greek legend. Observers in both hemispheres can find Cetus during autumn evenings, tracing its elongated shape across the sky."
  },
  {
    "id": 22,
    "name": "Chamaeleon",
    "abbreviation": "Cha",
    "genitive": "Chamaeleontis",
    "type": "southern",
    "area_sq_deg": 132,
    "brightest_star": "Alpha Chamaeleontis",
    "brightest_star_magnitude": 4.06,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "April",
    "description": "Chamaeleon is a small southern constellation representing the chameleon, located near Musca and Carina. Its brightest star, Alpha Chamaeleontis, is faint at magnitude 4.06. The constellation contains several small open clusters and dark nebulae. Introduced by Lacaille in the 18th century, Chamaeleon is named after the adaptive lizard, reflecting the era's scientific inspirations. Best viewed in southern autumn, it requires dark skies for observation due to its low brightness."
  },
  {
    "id": 23,
    "name": "Circinus",
    "abbreviation": "Cir",
    "genitive": "Circini",
    "type": "southern",
    "area_sq_deg": 93,
    "brightest_star": "Alpha Circini",
    "brightest_star_magnitude": 3.19,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +10°",
    "best_visible_month": "July",
    "description": "Circinus is a small southern constellation representing a drafting compass, located near Centaurus and Musca. Its brightest star, Alpha Circini, is a magnitude 3.19 white star. Circinus contains faint galaxies and star clusters observable with medium telescopes. Introduced by Lacaille in the 18th century, it honors scientific instruments. Best viewed during southern winter evenings, Circinus is a subtle constellation appreciated by dedicated stargazers."
  },
  {
    "id": 24,
    "name": "Columba",
    "abbreviation": "Col",
    "genitive": "Columbae",
    "type": "southern",
    "area_sq_deg": 270,
    "brightest_star": "Phact",
    "brightest_star_magnitude": 2.65,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "February",
    "description": "Columba, the dove, is a southern constellation located near Canis Major and Lepus. Its brightest star, Phact (Alpha Columbae), is a blue-white star of magnitude 2.65. Columba contains several faint galaxies, but no Messier objects. Introduced by Petrus Plancius in the late 16th century, it symbolizes peace. The constellation is best seen in late summer and early autumn in the Southern Hemisphere, where its stars form a simple, recognizable pattern."
  },
  {
    "id": 25,
    "name": "Coma Berenices",
    "abbreviation": "Com",
    "genitive": "Comae Berenices",
    "type": "northern",
    "area_sq_deg": 386,
    "brightest_star": "Beta Comae Berenices",
    "brightest_star_magnitude": 4.26,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 3,
    "messier_objects": ["M53", "M64", "M85"],
    "visible_latitude_range": "-70° to +90°",
    "best_visible_month": "April",
    "description": "Coma Berenices, the hair of Queen Berenice, is a northern constellation located near Leo and Virgo. Its brightest star, Beta Comae Berenices, has magnitude 4.26. The constellation is notable for its rich collection of galaxies including M64 (Black Eye Galaxy), M53 (globular cluster), and M85. It was historically linked to the legendary sacrifice of Queen Berenice’s hair in Egypt. Best observed in spring, it offers a wealth of targets for amateur astronomers with small telescopes."
  },
  {
    "id": 26,
    "name": "Corona Australis",
    "abbreviation": "CrA",
    "genitive": "Coronae Australis",
    "type": "southern",
    "area_sq_deg": 128,
    "brightest_star": "Alpha Coronae Australis",
    "brightest_star_magnitude": 4.10,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "August",
    "description": "Corona Australis, the southern crown, is a small southern constellation located near Sagittarius and Scorpius. Its brightest star, Alpha CrA, shines at magnitude 4.10. The constellation contains several small star clusters and reflection nebulae. Associated with the myth of Bacchus, it represents the crown worn by the god of wine. Best seen during southern winter evenings, Corona Australis is easy to identify by its semicircular arc of stars resembling a crown."
  },
  {
    "id": 27,
    "name": "Corona Borealis",
    "abbreviation": "CrB",
    "genitive": "Coronae Borealis",
    "type": "northern",
    "area_sq_deg": 179,
    "brightest_star": "Alphecca",
    "brightest_star_magnitude": 2.23,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 2,
    "messier_objects": [],
    "visible_latitude_range": "-50° to +90°",
    "best_visible_month": "July",
    "description": "Corona Borealis, the northern crown, is a small northern constellation shaped like a semicircular arc. Its brightest star, Alphecca (Alpha Coronae Borealis), is a white star of magnitude 2.23. The constellation has mythological ties to the crown of Ariadne in Greek mythology. Best observed in summer evenings, it lies near Hercules and Boötes, making it a key feature of the northern sky. Amateur astronomers can enjoy tracing its elegant arc and spotting nearby variable stars."
  },
  {
    "id": 28,
    "name": "Corvus",
    "abbreviation": "Crv",
    "genitive": "Corvi",
    "type": "southern",
    "area_sq_deg": 184,
    "brightest_star": "Gienah",
    "brightest_star_magnitude": 2.59,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-70° to +50°",
    "best_visible_month": "May",
    "description": "Corvus, the crow, is a small southern constellation located near Virgo and Hydra. Its brightest star, Gienah, is magnitude 2.59 and marks one end of the quadrilateral forming the crow. Mythologically, Corvus is associated with Apollo’s myth involving a crow and a cup. Best observed in late spring, Corvus is easy to identify by its kite-shaped pattern of stars. It contains no Messier objects but has several faint galaxies for telescope observers."
  },
  {
    "id": 29,
    "name": "Crater",
    "abbreviation": "Crt",
    "genitive": "Crateris",
    "type": "southern",
    "area_sq_deg": 282,
    "brightest_star": "Delta Crateris",
    "brightest_star_magnitude": 3.56,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-70° to +40°",
    "best_visible_month": "April",
    "description": "Crater, the cup, is a southern constellation situated above Hydra and next to Corvus. Its brightest star, Delta Crateris, has magnitude 3.56. Crater contains no notable deep-sky objects but is easily identified by its small grouping of stars forming a cup shape. The constellation is tied to Greek mythology, representing the cup of Apollo. Best observed in spring, Crater’s pattern is subtle but recognizable for observers tracing the surrounding constellations."
  },
  {
    "id": 30,
    "name": "Crux",
    "abbreviation": "Cru",
    "genitive": "Crucis",
    "type": "southern",
    "area_sq_deg": 68,
    "brightest_star": "Acrux",
    "brightest_star_magnitude": 0.77,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "May",
    "description": "Crux, the Southern Cross, is the most famous southern constellation, easily recognizable by its cross shape. Located near Centaurus and Carina, its brightest star, Acrux, is a multiple star system of magnitude 0.77. Crux serves as a key navigation reference in the Southern Hemisphere. It has been culturally significant for Indigenous Australians and South Pacific navigators. Best observed during southern autumn evenings, Crux is visible throughout the year in the southernmost latitudes."
  },
  {
    "id": 31,
    "name": "Cygnus",
    "abbreviation": "Cyg",
    "genitive": "Cygni",
    "type": "northern",
    "area_sq_deg": 804,
    "brightest_star": "Deneb",
    "brightest_star_magnitude": 1.25,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 7,
    "messier_objects": ["M29", "M39"],
    "visible_latitude_range": "-40° to +90°",
    "best_visible_month": "September",
    "description": "Cygnus, the swan, is a northern constellation lying along the Milky Way between Lyra and Pegasus. Its brightest star, Deneb, forms one corner of the Summer Triangle and is one of the most luminous stars known. Cygnus contains several notable deep-sky objects, including the North America Nebula and open clusters M29 and M39. In mythology, Cygnus represents the swan form taken by Zeus or the transformed friend Phaethon. Best viewed in late summer and early autumn, it provides rich star fields for telescope observation."
  },
  {
    "id": 32,
    "name": "Delphinus",
    "abbreviation": "Del",
    "genitive": "Delphini",
    "type": "northern",
    "area_sq_deg": 189,
    "brightest_star": "Sualocin",
    "brightest_star_magnitude": 3.77,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-70° to +90°",
    "best_visible_month": "September",
    "description": "Delphinus, the dolphin, is a small northern constellation located near Cygnus and Aquila. Its brightest star, Sualocin, has magnitude 3.77. The constellation forms a distinctive diamond shape with a tail and is associated with Greek mythology as the dolphin sent to rescue the poet Arion. Though it contains no Messier objects, several faint star clusters are visible with amateur telescopes. Best viewed in late summer, Delphinus is easily recognizable due to its compact and elegant shape."
  },
  {
    "id": 33,
    "name": "Dorado",
    "abbreviation": "Dor",
    "genitive": "Doradus",
    "type": "southern",
    "area_sq_deg": 179,
    "brightest_star": "Alpha Doradus",
    "brightest_star_magnitude": 3.27,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "January",
    "description": "Dorado, the dolphinfish or swordfish, is a southern constellation near the Large Magellanic Cloud. Its brightest star, Alpha Doradus, has magnitude 3.27. Dorado contains part of the Large Magellanic Cloud, which hosts numerous star clusters and nebulae, making it a popular target for telescope observers. Introduced by Lacaille in the 18th century, it is part of a group of southern constellations representing exotic animals and instruments. Best seen in southern summer evenings, Dorado offers rich deep-sky observation opportunities."
  },
  {
    "id": 34,
    "name": "Draco",
    "abbreviation": "Dra",
    "genitive": "Draconis",
    "type": "northern",
    "area_sq_deg": 1083,
    "brightest_star": "Eltanin",
    "brightest_star_magnitude": 2.23,
    "number_of_main_stars": 14,
    "number_of_stars_with_planets": 4,
    "messier_objects": ["NGC 6543"],
    "visible_latitude_range": "-15° to +90°",
    "best_visible_month": "July",
    "description": "Draco, the dragon, is a large northern constellation winding around the north celestial pole, near Ursa Minor and Hercules. Its brightest star, Eltanin, is a red giant of magnitude 2.23. Draco contains the Cat's Eye Nebula (NGC 6543) and several globular clusters. In mythology, Draco represents a dragon guarding the golden apples of the Hesperides. Best observed in summer evenings, its serpentine shape is easy to trace, offering northern observers a dramatic view of winding star patterns."
  },
  {
    "id": 35,
    "name": "Equuleus",
    "abbreviation": "Equ",
    "genitive": "Equulei",
    "type": "northern",
    "area_sq_deg": 72,
    "brightest_star": "Kitalpha",
    "brightest_star_magnitude": 3.92,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-70° to +90°",
    "best_visible_month": "September",
    "description": "Equuleus, the little horse, is one of the smallest northern constellations, located near Pegasus and Delphinus. Its brightest star, Kitalpha, has magnitude 3.92. Equuleus contains few deep-sky objects and no Messier entries. In mythology, it represents the foal of Pegasus. Despite its small size, it is recognizable by its compact four-star pattern. Best observed in late summer, Equuleus is often sought by enthusiasts aiming to identify all 88 constellations."
  },
  {
    "id": 36,
    "name": "Eridanus",
    "abbreviation": "Eri",
    "genitive": "Eridani",
    "type": "southern",
    "area_sq_deg": 1138,
    "brightest_star": "Achernar",
    "brightest_star_magnitude": 0.46,
    "number_of_main_stars": 23,
    "number_of_stars_with_planets": 9,
    "messier_objects": ["NGC 1535"],
    "visible_latitude_range": "-90° to +32°",
    "best_visible_month": "December",
    "description": "Eridanus, the river, is a long southern constellation stretching from Orion toward the southern sky. Its brightest star, Achernar, is one of the brightest stars in the night sky. Eridanus hosts several notable deep-sky objects including planetary nebula NGC 1535 and several star clusters. Mythologically, it represents the river Po or Nile. Best viewed during winter evenings, its winding chain of stars provides a guide for tracing southern celestial rivers."
  },
  {
    "id": 37,
    "name": "Fornax",
    "abbreviation": "For",
    "genitive": "Fornacis",
    "type": "southern",
    "area_sq_deg": 398,
    "brightest_star": "Alpha Fornacis",
    "brightest_star_magnitude": 3.85,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": ["Fornax Cluster (NGC 1399)"],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "December",
    "description": "Fornax, the furnace, is a southern constellation introduced by Lacaille in the 18th century, located near Eridanus and Sculptor. Its brightest star, Alpha Fornacis, has magnitude 3.85. Fornax contains the Fornax Galaxy Cluster, a rich collection of galaxies popular with amateur telescopes. The constellation represents the scientific instrument, the furnace, reflecting the Enlightenment period’s focus on science. Best observed in southern summer, Fornax is ideal for galaxy hunting under dark skies."
  },
  {
    "id": 38,
    "name": "Gemini",
    "abbreviation": "Gem",
    "genitive": "Geminorum",
    "type": "northern",
    "area_sq_deg": 514,
    "brightest_star": "Castor",
    "brightest_star_magnitude": 1.58,
    "number_of_main_stars": 8,
    "number_of_stars_with_planets": 10,
    "messier_objects": ["M35"],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "February",
    "description": "Gemini, the twins, is a zodiac constellation located between Taurus and Cancer. Its main stars, Castor and Pollux, represent the twins in Greek mythology. Gemini contains the open cluster M35 near its 'foot'. The constellation is visible during winter in the Northern Hemisphere and early summer in the Southern Hemisphere. It is characterized by its two bright stars and connecting lines forming twin figures, making it easy for observers to recognize."
  },
  {
    "id": 39,
    "name": "Grus",
    "abbreviation": "Gru",
    "genitive": "Gruis",
    "type": "southern",
    "area_sq_deg": 366,
    "brightest_star": "Alnair",
    "brightest_star_magnitude": 1.74,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "October",
    "description": "Grus, the crane, is a southern constellation located near Phoenix and Piscis Austrinus. Its brightest star, Alnair, shines at magnitude 1.74. The constellation contains several small star clusters and is notable for its elegant long-necked shape. Introduced by Plancius in the late 16th century, Grus symbolizes the bird crane. Best viewed in southern spring evenings, it is a favorite among observers completing the southern sky constellations."
  },
  {
    "id": 40,
    "name": "Hercules",
    "abbreviation": "Her",
    "genitive": "Herculis",
    "type": "northern",
    "area_sq_deg": 1225,
    "brightest_star": "Ras Algethi",
    "brightest_star_magnitude": 2.78,
    "number_of_main_stars": 14,
    "number_of_stars_with_planets": 6,
    "messier_objects": ["M13", "M92"],
    "visible_latitude_range": "-55° to +90°",
    "best_visible_month": "July",
    "description": "Hercules is a northern constellation representing the mythological hero and located near Lyra and Draco. Its brightest star, Ras Algethi, is a red giant of magnitude 2.78. Hercules hosts several globular clusters, including M13, one of the finest visible clusters, and M92. Mythologically, it represents the strength and labors of Hercules. Best observed in summer evenings, it offers wide fields for amateur telescopes and is rich in deep-sky targets for stargazing."
  },
  {
    "id": 41,
    "name": "Horologium",
    "abbreviation": "Hor",
    "genitive": "Horologii",
    "type": "southern",
    "area_sq_deg": 248,
    "brightest_star": "Alpha Horologii",
    "brightest_star_magnitude": 3.85,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "December",
    "description": "Horologium, the clock, is a small southern constellation introduced by Lacaille in the 18th century. Its brightest star, Alpha Horologii, shines at magnitude 3.85. Horologium contains several faint stars but no Messier objects. Symbolizing a pendulum clock, it reflects the scientific focus of the Enlightenment. Best observed during southern summer evenings, the constellation is subtle but can be identified by connecting its main stars to form a simple quadrilateral pattern."
  },
  {
    "id": 42,
    "name": "Hydra",
    "abbreviation": "Hya",
    "genitive": "Hydrae",
    "type": "southern",
    "area_sq_deg": 1303,
    "brightest_star": "Alphard",
    "brightest_star_magnitude": 1.98,
    "number_of_main_stars": 17,
    "number_of_stars_with_planets": 8,
    "messier_objects": ["M48", "M68", "M83"],
    "visible_latitude_range": "-90° to +54°",
    "best_visible_month": "March",
    "description": "Hydra, the water snake, is the largest of all 88 constellations, stretching across the southern sky near Cancer and Crater. Its brightest star, Alphard, is an orange giant of magnitude 1.98. Hydra contains several open clusters and galaxies, including M48, M68, and M83. In mythology, it represents the Lernaean Hydra defeated by Hercules. Best viewed during late winter and early spring, Hydra’s long, winding form is identifiable despite its faint stars."
  },
  {
    "id": 43,
    "name": "Hydrus",
    "abbreviation": "Hyi",
    "genitive": "Hydri",
    "type": "southern",
    "area_sq_deg": 243,
    "brightest_star": "Beta Hydri",
    "brightest_star_magnitude": 2.80,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 2,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "November",
    "description": "Hydrus, the lesser water snake, is a southern constellation near the south celestial pole, introduced by Dutch explorers in the 16th century. Its brightest star, Beta Hydri, is a yellow-white star of magnitude 2.80. Hydrus contains a few double stars and faint galaxies. The constellation represents a smaller water snake in contrast to Hydra. Best observed in southern spring evenings, Hydrus is notable for its location in the deep southern sky and is primarily visible to Southern Hemisphere observers."
  },
  {
    "id": 44,
    "name": "Indus",
    "abbreviation": "Ind",
    "genitive": "Indi",
    "type": "southern",
    "area_sq_deg": 294,
    "brightest_star": "Alpha Indi",
    "brightest_star_magnitude": 3.11,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +15°",
    "best_visible_month": "August",
    "description": "Indus is a southern constellation representing an indigenous person, introduced by Dutch navigators in the late 16th century. Its brightest star, Alpha Indi, is magnitude 3.11. Indus contains no notable Messier objects but includes several faint stars. Best observed in southern winter evenings, the constellation occupies a dark sky region, offering a challenge for casual observers but a rewarding experience for star chart enthusiasts."
  },
  {
    "id": 45,
    "name": "Lacerta",
    "abbreviation": "Lac",
    "genitive": "Lacertae",
    "type": "northern",
    "area_sq_deg": 201,
    "brightest_star": "Alpha Lacertae",
    "brightest_star_magnitude": 3.77,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-55° to +90°",
    "best_visible_month": "September",
    "description": "Lacerta, the lizard, is a small northern constellation introduced by Hevelius in the 17th century, located between Cygnus and Andromeda. Its brightest star, Alpha Lacertae, shines at magnitude 3.77. Lacerta contains a few double stars and open clusters but no Messier objects. Its zigzagging pattern resembles a lizard in flight. Best observed in autumn evenings, it is faint but identifiable with clear, dark skies."
  },
  {
    "id": 46,
    "name": "Leo",
    "abbreviation": "Leo",
    "genitive": "Leonis",
    "type": "northern",
    "area_sq_deg": 947,
    "brightest_star": "Regulus",
    "brightest_star_magnitude": 1.35,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 8,
    "messier_objects": ["M65", "M66", "M95", "M96", "M105"],
    "visible_latitude_range": "-30° to +90°",
    "best_visible_month": "April",
    "description": "Leo, the lion, is a prominent zodiac constellation in the northern sky between Cancer and Virgo. Its brightest star, Regulus, is a multiple star system of magnitude 1.35. Leo contains several notable galaxies in the Leo Triplet (M65, M66, NGC 3628) and other Messier objects (M95, M96, M105). In mythology, it represents the Nemean Lion slain by Hercules. Best observed in spring, Leo’s distinctive sickle-shaped head and body make it easily recognizable for stargazers."
  },
  {
    "id": 47,
    "name": "Leo Minor",
    "abbreviation": "LMi",
    "genitive": "Leonis Minoris",
    "type": "northern",
    "area_sq_deg": 232,
    "brightest_star": "46 Leonis Minoris",
    "brightest_star_magnitude": 3.83,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "April",
    "description": "Leo Minor, the smaller lion, is a faint northern constellation introduced by Hevelius in the 17th century, located between Ursa Major and Leo. Its brightest star, 46 Leonis Minoris, has magnitude 3.83. The constellation contains few notable deep-sky objects. Best observed in spring, Leo Minor is appreciated for its subtle arrangement of stars forming a small, lion-like figure above the main Leo constellation."
  },
  {
    "id": 48,
    "name": "Lepus",
    "abbreviation": "Lep",
    "genitive": "Leporis",
    "type": "southern",
    "area_sq_deg": 290,
    "brightest_star": "Arneb",
    "brightest_star_magnitude": 2.58,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 1,
    "messier_objects": ["M79"],
    "visible_latitude_range": "-90° to +45°",
    "best_visible_month": "December",
    "description": "Lepus, the hare, is a southern constellation located just below Orion. Its brightest star, Arneb, is a yellow supergiant of magnitude 2.58. Lepus contains the globular cluster M79. In mythology, Lepus represents the hare hunted by Orion. Best viewed in winter evenings, Lepus is easily found beneath Orion’s belt and provides a fascinating target for observing its brightest stars and clusters."
  },
  {
    "id": 49,
    "name": "Libra",
    "abbreviation": "Lib",
    "genitive": "Librae",
    "type": "southern",
    "area_sq_deg": 538,
    "brightest_star": "Zubeneschamali",
    "brightest_star_magnitude": 2.61,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 5,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +65°",
    "best_visible_month": "June",
    "description": "Libra, the scales, is a zodiac constellation located between Virgo and Scorpius. Its brightest star, Zubeneschamali, is a greenish star of magnitude 2.61. Libra contains few deep-sky objects but is important for tracking the ecliptic. In mythology, it represents justice and balance. Best observed in late spring and early summer, Libra’s main stars form a quadrilateral resembling a set of scales."
  },
  {
    "id": 50,
    "name": "Lupus",
    "abbreviation": "Lup",
    "genitive": "Lupi",
    "type": "southern",
    "area_sq_deg": 334,
    "brightest_star": "Alpha Lupi",
    "brightest_star_magnitude": 2.30,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 2,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +25°",
    "best_visible_month": "June",
    "description": "Lupus, the wolf, is a southern constellation situated between Centaurus and Scorpius. Its brightest star, Alpha Lupi, is a blue giant of magnitude 2.30. Lupus contains several double stars and variable stars but no Messier objects. Mythologically, it represents a wolf hunted by Centaurus. Best viewed in southern winter evenings, Lupus offers an interesting field for observers exploring southern zodiac constellations."
  },
  {
    "id": 51,
    "name": "Lynx",
    "abbreviation": "Lyn",
    "genitive": "Lyncis",
    "type": "northern",
    "area_sq_deg": 545,
    "brightest_star": "Alpha Lyncis",
    "brightest_star_magnitude": 3.14,
    "number_of_main_stars": 8,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-30° to +90°",
    "best_visible_month": "February",
    "description": "Lynx is a faint northern constellation introduced by Hevelius in the 17th century, located between Ursa Major and Auriga. Its brightest star, Alpha Lyncis, shines at magnitude 3.14. Lynx contains no Messier objects but includes several double stars and faint galaxies. Named after the elusive wild cat, it is best observed in late winter. The constellation is notable for its sparse stars, making it a challenge to identify without a detailed star chart."
  },
  {
    "id": 52,
    "name": "Lyra",
    "abbreviation": "Lyr",
    "genitive": "Lyrae",
    "type": "northern",
    "area_sq_deg": 286,
    "brightest_star": "Vega",
    "brightest_star_magnitude": 0.03,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 4,
    "messier_objects": ["M57"],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "August",
    "description": "Lyra, the lyre, is a small northern constellation near Cygnus and Hercules. Its brightest star, Vega, is a first-magnitude star and part of the Summer Triangle. Lyra contains the famous Ring Nebula (M57) and several double stars. Mythologically, Lyra represents Orpheus's musical instrument. Best observed in summer evenings, the constellation’s compact shape and bright stars make it easy to locate, even in moderately light-polluted skies."
  },
  {
    "id": 53,
    "name": "Mensa",
    "abbreviation": "Men",
    "genitive": "Mensae",
    "type": "southern",
    "area_sq_deg": 153,
    "brightest_star": "Alpha Mensae",
    "brightest_star_magnitude": 5.09,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +15°",
    "best_visible_month": "January",
    "description": "Mensa is a faint southern constellation located near the Large Magellanic Cloud and introduced by Lacaille in the 18th century. Its brightest star, Alpha Mensae, is magnitude 5.09. Mensa contains no Messier objects but offers a view of parts of the LMC. Representing Table Mountain in South Africa, it reflects the era’s focus on global geography and exploration. Best observed in southern summer evenings, it requires dark skies for clear identification."
  },
  {
    "id": 54,
    "name": "Microscopium",
    "abbreviation": "Mic",
    "genitive": "Microscopii",
    "type": "southern",
    "area_sq_deg": 210,
    "brightest_star": "Gamma Microscopii",
    "brightest_star_magnitude": 4.67,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "August",
    "description": "Microscopium, the microscope, is a small southern constellation introduced by Lacaille in the 18th century. Its brightest star, Gamma Microscopii, shines at magnitude 4.67. The constellation contains faint stars but no Messier objects. It symbolizes scientific instruments, reflecting Enlightenment values. Best observed during southern winter, Microscopium is subtle and requires clear skies for observation."
  },
  {
    "id": 55,
    "name": "Monoceros",
    "abbreviation": "Mon",
    "genitive": "Monocerotis",
    "type": "northern",
    "area_sq_deg": 482,
    "brightest_star": "Beta Monocerotis",
    "brightest_star_magnitude": 3.76,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 3,
    "messier_objects": ["NGC 2244", "NGC 2264"],
    "visible_latitude_range": "-70° to +80°",
    "best_visible_month": "February",
    "description": "Monoceros, the unicorn, is a faint northern constellation located along the Milky Way between Orion and Canis Minor. Its brightest star, Beta Monocerotis, is a triple star system of magnitude 3.76. The constellation contains notable deep-sky objects such as the Rosette Nebula (NGC 2244) and the Christmas Tree Cluster (NGC 2264). Monoceros was introduced in the early 17th century and represents the mythical unicorn. Best viewed in winter evenings, it is ideal for observing faint nebulae and star clusters with binoculars or telescopes."
  },
  {
    "id": 56,
    "name": "Musca",
    "abbreviation": "Mus",
    "genitive": "Muscae",
    "type": "southern",
    "area_sq_deg": 138,
    "brightest_star": "Alpha Muscae",
    "brightest_star_magnitude": 2.69,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +10°",
    "best_visible_month": "May",
    "description": "Musca, the fly, is a small southern constellation located near Crux and Centaurus. Its brightest star, Alpha Muscae, shines at magnitude 2.69. Musca contains a few double stars but no Messier objects. Introduced by Dutch navigators in the 16th century, it represents an insect, unusual among celestial figures. Best observed in southern autumn evenings, Musca is easily identifiable due to its position close to the prominent Southern Cross."
  },
  {
    "id": 57,
    "name": "Norma",
    "abbreviation": "Nor",
    "genitive": "Normae",
    "type": "southern",
    "area_sq_deg": 165,
    "brightest_star": "Gamma Normae",
    "brightest_star_magnitude": 4.01,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "July",
    "description": "Norma, the level or carpenter's square, is a southern constellation introduced by Lacaille in the 18th century. Its brightest star, Gamma Normae, is magnitude 4.01. Norma contains faint stars and no Messier objects. Representing scientific instruments, it reflects Enlightenment values. Best observed in southern winter evenings, Norma’s subtle stars form a simple quadrilateral pattern, making it identifiable with careful observation."
  },
  {
    "id": 58,
    "name": "Octans",
    "abbreviation": "Oct",
    "genitive": "Octantis",
    "type": "southern",
    "area_sq_deg": 291,
    "brightest_star": "Nu Octantis",
    "brightest_star_magnitude": 3.73,
    "number_of_main_stars": 3,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +10°",
    "best_visible_month": "October",
    "description": "Octans, the octant, is a southern constellation near the south celestial pole, introduced by Lacaille in the 18th century. Its brightest star, Nu Octantis, has magnitude 3.73. Octans contains the south celestial pole, making it important for navigation, but contains no bright deep-sky objects. Best observed in southern spring evenings, Octans is faint and best identified using star charts and telescopes."
  },
  {
    "id": 59,
    "name": "Ophiuchus",
    "abbreviation": "Oph",
    "genitive": "Ophiuchi",
    "type": "northern",
    "area_sq_deg": 948,
    "brightest_star": "Rasalhague",
    "brightest_star_magnitude": 2.07,
    "number_of_main_stars": 11,
    "number_of_stars_with_planets": 10,
    "messier_objects": ["M10", "M12", "M14", "M19", "M62"],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "July",
    "description": "Ophiuchus, the serpent-bearer, is a large northern constellation located near Hercules and Serpens. Its brightest star, Rasalhague, is a white giant of magnitude 2.07. Ophiuchus contains several globular clusters, including M10, M12, M14, M19, and M62. In mythology, it represents Asclepius, the healer, holding a serpent. Best viewed in summer evenings, it offers a rich field of telescopic targets, especially globular clusters."
  },
  {
    "id": 60,
    "name": "Orion",
    "abbreviation": "Ori",
    "genitive": "Orionis",
    "type": "northern",
    "area_sq_deg": 594,
    "brightest_star": "Rigel",
    "brightest_star_magnitude": 0.13,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 7,
    "messier_objects": ["M42", "M43", "M78"],
    "visible_latitude_range": "-85° to +85°",
    "best_visible_month": "January",
    "description": "Orion, the hunter, is one of the most recognizable northern constellations, located on the celestial equator. Its brightest star, Rigel, is a blue supergiant of magnitude 0.13, while Betelgeuse, a red supergiant, also stands out prominently. Orion contains several bright stars forming the iconic 'belt' and notable deep-sky objects including the Orion Nebula (M42), M43, and M78. In mythology, Orion represents a hunter pursued by Scorpio. Best observed in winter, Orion is a favorite for both amateur and professional astronomers due to its striking shape and rich celestial features."
  },
  {
    "id": 61,
    "name": "Pavo",
    "abbreviation": "Pav",
    "genitive": "Pavonis",
    "type": "southern",
    "area_sq_deg": 378,
    "brightest_star": "Alpha Pavonis",
    "brightest_star_magnitude": 1.94,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +10°",
    "best_visible_month": "August",
    "description": "Pavo, the peacock, is a southern constellation introduced by Dutch navigators in the late 16th century. Its brightest star, Alpha Pavonis, is magnitude 1.94. Pavo contains a few faint deep-sky objects, including small open clusters. Representing the bird peacock, it is best observed in southern winter evenings. The constellation is easily identified by its bright star and the general fan-shaped pattern of stars resembling the bird’s tail."
  },
  {
    "id": 62,
    "name": "Pegasus",
    "abbreviation": "Peg",
    "genitive": "Pegasi",
    "type": "northern",
    "area_sq_deg": 1121,
    "brightest_star": "Enif",
    "brightest_star_magnitude": 2.39,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 12,
    "messier_objects": ["M15"],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "October",
    "description": "Pegasus, the winged horse, is a prominent northern constellation known for its large square asterism called the Great Square of Pegasus. Its brightest star, Enif, is a supergiant of magnitude 2.39. Pegasus contains several notable deep-sky objects, including the globular cluster M15. In mythology, Pegasus represents the winged horse born from Medusa’s blood. Best viewed in autumn evenings, the Great Square is a key feature for locating nearby constellations such as Andromeda and Pisces."
  },
  {
    "id": 63,
    "name": "Perseus",
    "abbreviation": "Per",
    "genitive": "Persei",
    "type": "northern",
    "area_sq_deg": 615,
    "brightest_star": "Mirfak",
    "brightest_star_magnitude": 1.79,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 5,
    "messier_objects": ["M34"],
    "visible_latitude_range": "-40° to +90°",
    "best_visible_month": "November",
    "description": "Perseus, the hero, is a northern constellation located near Andromeda and Cassiopeia. Its brightest star, Mirfak, is a white supergiant of magnitude 1.79. Perseus contains the famous variable star Algol, also known as the Demon Star, and the open cluster M34. Mythologically, it represents the Greek hero Perseus who rescued Andromeda. Best observed in autumn evenings, Perseus is a rich field for observing variable stars and clusters."
  },
  {
    "id": 64,
    "name": "Phoenix",
    "abbreviation": "Phe",
    "genitive": "Phoenicis",
    "type": "southern",
    "area_sq_deg": 469,
    "brightest_star": "Ankaa",
    "brightest_star_magnitude": 2.39,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +32°",
    "best_visible_month": "November",
    "description": "Phoenix is a southern constellation introduced by Dutch navigators in the late 16th century. Its brightest star, Ankaa, has magnitude 2.39. Phoenix contains few notable deep-sky objects, primarily small star clusters. Representing the mythical phoenix bird, the constellation is best observed during southern spring evenings. Its modest star pattern forms a simple bird shape, which is most easily recognized in dark skies."
  },
  {
    "id": 65,
    "name": "Pictor",
    "abbreviation": "Pic",
    "genitive": "Pictoris",
    "type": "southern",
    "area_sq_deg": 247,
    "brightest_star": "Alpha Pictoris",
    "brightest_star_magnitude": 3.30,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "January",
    "description": "Pictor, the painter’s easel, is a small southern constellation introduced by Lacaille in the 18th century. Its brightest star, Alpha Pictoris, shines at magnitude 3.30. Pictor contains few faint stars and no Messier objects. Representing a painter's easel, it reflects the period’s appreciation for science and the arts. Best observed in southern summer evenings, it is subtle and requires a dark sky for proper identification."
  },
  {
    "id": 66,
    "name": "Pisces",
    "abbreviation": "Psc",
    "genitive": "Piscium",
    "type": "northern",
    "area_sq_deg": 889,
    "brightest_star": "Alrescha",
    "brightest_star_magnitude": 3.82,
    "number_of_main_stars": 18,
    "number_of_stars_with_planets": 5,
    "messier_objects": ["M74"],
    "visible_latitude_range": "-65° to +90°",
    "best_visible_month": "November",
    "description": "Pisces, the fish, is a zodiac constellation located between Aquarius and Aries. Its brightest star, Alrescha, is magnitude 3.82 and marks the knot connecting the two fish. Pisces contains the spiral galaxy M74 and several faint stars forming the fish shapes. Mythologically, it represents the two fish into which Aphrodite and Eros transformed. Best viewed in autumn evenings, Pisces is faint but recognizable with dark skies and serves as a reference for locating nearby constellations."
  },
  {
    "id": 67,
    "name": "Piscis Austrinus",
    "abbreviation": "PsA",
    "genitive": "Piscis Austrini",
    "type": "southern",
    "area_sq_deg": 245,
    "brightest_star": "Fomalhaut",
    "brightest_star_magnitude": 1.16,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 4,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "September",
    "description": "Piscis Austrinus, the southern fish, is a southern constellation best known for its bright star Fomalhaut, magnitude 1.16. The constellation contains few other notable stars and no Messier objects. In mythology, it represents a fish drinking from the celestial river. Best observed in southern autumn evenings, Fomalhaut is one of the few first-magnitude stars in the far southern sky and is easily visible even in moderately light-polluted areas."
  },
  {
    "id": 68,
    "name": "Puppis",
    "abbreviation": "Pup",
    "genitive": "Puppis",
    "type": "southern",
    "area_sq_deg": 673,
    "brightest_star": "Naos",
    "brightest_star_magnitude": 2.21,
    "number_of_main_stars": 8,
    "number_of_stars_with_planets": 2,
    "messier_objects": ["M46", "M47"],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "February",
    "description": "Puppis, the stern of the ship Argo, is a southern constellation and part of the former large constellation Argo Navis. Its brightest star, Naos, shines at magnitude 2.21. Puppis contains several open clusters, including M46 and M47. In mythology, it represents the ship carrying Jason and the Argonauts. Best observed in late summer to winter evenings in the Southern Hemisphere, Puppis offers rich star fields for telescope enthusiasts."
  },
  {
    "id": 69,
    "name": "Pyxis",
    "abbreviation": "Pyx",
    "genitive": "Pyxidis",
    "type": "southern",
    "area_sq_deg": 221,
    "brightest_star": "Alpha Pyxidis",
    "brightest_star_magnitude": 3.68,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +30°",
    "best_visible_month": "January",
    "description": "Pyxis, the mariner's compass, is a southern constellation introduced by Lacaille in the 18th century. Its brightest star, Alpha Pyxidis, has magnitude 3.68. Pyxis contains no Messier objects and few other bright stars. Representing a compass, the constellation reflects the navigation tools used by explorers. Best observed during southern summer evenings, it is easily found near Vela and Puppis."
  },
  {
    "id": 70,
    "name": "Reticulum",
    "abbreviation": "Ret",
    "genitive": "Reticuli",
    "type": "southern",
    "area_sq_deg": 114,
    "brightest_star": "Alpha Reticuli",
    "brightest_star_magnitude": 3.33,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "December",
    "description": "Reticulum, the net, is a small southern constellation introduced by Lacaille in the 18th century. Its brightest star, Alpha Reticuli, shines at magnitude 3.33. Reticulum contains few faint stars and no Messier objects. The constellation represents a reticle, reflecting instruments for astronomical measurements. Best observed in southern summer evenings, it is subtle but identifiable with dark skies and careful star chart reference."
  },
  {
    "id": 71,
    "name": "Sagitta",
    "abbreviation": "Sge",
    "genitive": "Sagittae",
    "type": "northern",
    "area_sq_deg": 79,
    "brightest_star": "Gamma Sagittae",
    "brightest_star_magnitude": 3.47,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "August",
    "description": "Sagitta, the arrow, is a small northern constellation located in the Milky Way between Aquila and Vulpecula. Its brightest star, Gamma Sagittae, has magnitude 3.47. Sagitta contains a few double stars and faint clusters but no Messier objects. Mythologically, it represents the arrow used by Hercules or Apollo. Best viewed in late summer evenings, the constellation is identifiable by its compact arrow-shaped arrangement of stars."
  },
  {
    "id": 72,
    "name": "Sagittarius",
    "abbreviation": "Sgr",
    "genitive": "Sagittarii",
    "type": "southern",
    "area_sq_deg": 867,
    "brightest_star": "Kaus Australis",
    "brightest_star_magnitude": 1.79,
    "number_of_main_stars": 12,
    "number_of_stars_with_planets": 9,
    "messier_objects": ["M8", "M17", "M20", "M21", "M22", "M23", "M24", "M25", "M28", "M54", "M55", "M69", "M70"],
    "visible_latitude_range": "-90° to +55°",
    "best_visible_month": "August",
    "description": "Sagittarius, the archer, is a prominent southern zodiac constellation located near the center of the Milky Way. Its brightest star, Kaus Australis, is a magnitude 1.79 giant star. Sagittarius is rich in deep-sky objects including many globular clusters (M22, M28, M54, M55, M69, M70) and nebulae (M8, M17, M20). Mythologically, it represents a centaur archer. Best observed in summer evenings from the Southern Hemisphere, its iconic 'Teapot' asterism helps locate the Milky Way center."
  },
  {
    "id": 73,
    "name": "Scorpius",
    "abbreviation": "Sco",
    "genitive": "Scorpii",
    "type": "southern",
    "area_sq_deg": 497,
    "brightest_star": "Antares",
    "brightest_star_magnitude": 0.96,
    "number_of_main_stars": 18,
    "number_of_stars_with_planets": 9,
    "messier_objects": ["M4", "M6", "M7", "M80"],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "July",
    "description": "Scorpius, the scorpion, is a prominent southern zodiac constellation near Sagittarius. Its brightest star, Antares, is a red supergiant of magnitude 0.96. Scorpius contains many bright stars and deep-sky objects, including globular clusters M4, M6, M7, and M80. In mythology, it represents the scorpion sent to kill Orion. Best observed in midsummer evenings, its long curving tail and bright stars make it easily recognizable, especially in the Southern Hemisphere."
  },
  {
    "id": 74,
    "name": "Sculptor",
    "abbreviation": "Scl",
    "genitive": "Sculptoris",
    "type": "southern",
    "area_sq_deg": 475,
    "brightest_star": "Alpha Sculptoris",
    "brightest_star_magnitude": 4.30,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": ["NGC 253"],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "November",
    "description": "Sculptor is a southern constellation introduced by Lacaille in the 18th century. Its brightest star, Alpha Sculptoris, has magnitude 4.30. Sculptor is notable for containing the Sculptor Galaxy (NGC 253), a bright spiral galaxy. Representing a sculptor’s studio, it reflects Enlightenment scientific culture. Best observed in southern spring evenings, the constellation is subtle but rewarding for deep-sky observation."
  },
  {
    "id": 75,
    "name": "Scutum",
    "abbreviation": "Sct",
    "genitive": "Scuti",
    "type": "northern",
    "area_sq_deg": 109,
    "brightest_star": "Alpha Scuti",
    "brightest_star_magnitude": 3.85,
    "number_of_main_stars": 5,
    "number_of_stars_with_planets": 1,
    "messier_objects": ["M11"],
    "visible_latitude_range": "-80° to +40°",
    "best_visible_month": "August",
    "description": "Scutum, the shield, is a small northern constellation introduced by Hevelius in 1684 as 'Scutum Sobiescianum.' Its brightest star, Alpha Scuti, shines at magnitude 3.85. Scutum contains the rich open cluster M11, also known as the Wild Duck Cluster. It represents a military shield honoring King Sobieski. Best observed in summer evenings, Scutum’s subtle pattern is easier to locate using the Milky Way as a reference."
  },
  {
    "id": 76,
    "name": "Serpens",
    "abbreviation": "Ser",
    "genitive": "Serpentis",
    "type": "northern",
    "area_sq_deg": 637,
    "brightest_star": "Unukalhai",
    "brightest_star_magnitude": 2.63,
    "number_of_main_stars": 11,
    "number_of_stars_with_planets": 6,
    "messier_objects": ["M5"],
    "visible_latitude_range": "-70° to +80°",
    "best_visible_month": "July",
    "description": "Serpens is a northern constellation uniquely divided into two parts: Serpens Caput (the head) and Serpens Cauda (the tail), separated by Ophiuchus. Its brightest star, Unukalhai, is magnitude 2.63. Serpens contains several globular clusters, including M5, and represents a serpent held by Ophiuchus. Best viewed in summer evenings, Serpens’ long, winding shape offers a challenge to locate but provides a rich field for telescopic observation."
  },
  {
    "id": 77,
    "name": "Sextans",
    "abbreviation": "Sex",
    "genitive": "Sextantis",
    "type": "southern",
    "area_sq_deg": 314,
    "brightest_star": "Alpha Sextantis",
    "brightest_star_magnitude": 4.49,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "April",
    "description": "Sextans, the sextant, is a faint southern constellation introduced by Hevelius in 1687. Its brightest star, Alpha Sextantis, shines at magnitude 4.49. Sextans contains few notable stars and no Messier objects. Representing the navigational instrument, the constellation reflects the importance of astronomical tools in exploration. Best observed in southern autumn evenings, Sextans is subtle and requires dark skies to identify."
  },
  {
    "id": 78,
    "name": "Taurus",
    "abbreviation": "Tau",
    "genitive": "Tauri",
    "type": "northern",
    "area_sq_deg": 797,
    "brightest_star": "Aldebaran",
    "brightest_star_magnitude": 0.85,
    "number_of_main_stars": 19,
    "number_of_stars_with_planets": 12,
    "messier_objects": ["M1", "M45", "M36", "M37", "M38"],
    "visible_latitude_range": "-65° to +90°",
    "best_visible_month": "January",
    "description": "Taurus, the bull, is a northern zodiac constellation prominent in winter. Its brightest star, Aldebaran, is a red giant of magnitude 0.85. Taurus contains the Pleiades (M45) and Hyades clusters, as well as the Crab Nebula (M1) and several other open clusters (M36, M37, M38). Mythologically, it represents the bull form of Zeus. Best viewed in winter evenings, Taurus’ bright stars and clusters make it a favorite for both naked-eye and telescopic observation."
  },
  {
    "id": 79,
    "name": "Telescopium",
    "abbreviation": "Tel",
    "genitive": "Telescopii",
    "type": "southern",
    "area_sq_deg": 252,
    "brightest_star": "Alpha Telescopii",
    "brightest_star_magnitude": 3.50,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "August",
    "description": "Telescopium, the telescope, is a small southern constellation introduced by Lacaille in the 18th century. Its brightest star, Alpha Telescopii, shines at magnitude 3.50. Telescopium contains few stars and no Messier objects. Representing the scientific instrument, it reflects Enlightenment ideals of observation and discovery. Best observed in southern winter evenings, the constellation requires a dark sky to be easily distinguished."
  },
  {
    "id": 80,
    "name": "Triangulum",
    "abbreviation": "Tri",
    "genitive": "Trianguli",
    "type": "northern",
    "area_sq_deg": 132,
    "brightest_star": "Beta Trianguli",
    "brightest_star_magnitude": 3.00,
    "number_of_main_stars": 3,
    "number_of_stars_with_planets": 2,
    "messier_objects": ["M33"],
    "visible_latitude_range": "-60° to +90°",
    "best_visible_month": "November",
    "description": "Triangulum, the triangle, is a small northern constellation located between Andromeda and Aries. Its brightest star, Beta Trianguli, has magnitude 3.00. Triangulum contains the famous Triangulum Galaxy (M33) and several faint stars forming a simple triangular shape. Representing a geometric triangle, it is best observed in autumn evenings. Despite its small size, the constellation is significant for locating M33 and serves as a reference for adjacent constellations."
  },
  {
    "id": 81,
    "name": "Triangulum Australe",
    "abbreviation": "TrA",
    "genitive": "Trianguli Australis",
    "type": "southern",
    "area_sq_deg": 110,
    "brightest_star": "Atria",
    "brightest_star_magnitude": 1.91,
    "number_of_main_stars": 3,
    "number_of_stars_with_planets": 1,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +10°",
    "best_visible_month": "July",
    "description": "Triangulum Australe, the southern triangle, is a small southern constellation introduced by Dutch navigators. Its brightest star, Atria, shines at magnitude 1.91. The constellation contains no Messier objects but is easily identified by its equilateral triangular pattern of stars. Representing a geometric triangle, it is prominent in southern winter evenings and serves as a reference for locating nearby constellations like Apus and Norma."
  },
  {
    "id": 82,
    "name": "Tucana",
    "abbreviation": "Tuc",
    "genitive": "Tucanae",
    "type": "southern",
    "area_sq_deg": 295,
    "brightest_star": "Alpha Tucanae",
    "brightest_star_magnitude": 2.87,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 1,
    "messier_objects": ["47 Tucanae"],
    "visible_latitude_range": "-90° to +20°",
    "best_visible_month": "October",
    "description": "Tucana, the toucan, is a southern constellation introduced by Dutch navigators. Its brightest star, Alpha Tucanae, is magnitude 2.87. Tucana contains the bright globular cluster 47 Tucanae, one of the largest in the sky. Representing the exotic bird, it reflects exploration of the southern skies. Best observed in spring evenings of the Southern Hemisphere, Tucana is relatively faint but rewarding for telescopic observations of 47 Tucanae."
  },
  {
    "id": 83,
    "name": "Ursa Major",
    "abbreviation": "UMa",
    "genitive": "Ursae Majoris",
    "type": "northern",
    "area_sq_deg": 1280,
    "brightest_star": "Alioth",
    "brightest_star_magnitude": 1.76,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 10,
    "messier_objects": ["M81", "M82", "M101", "M108", "M97", "M109"],
    "visible_latitude_range": "-30° to +90°",
    "best_visible_month": "April",
    "description": "Ursa Major, the great bear, is a large northern constellation famous for the Big Dipper asterism. Its brightest star, Alioth, shines at magnitude 1.76. Ursa Major contains numerous galaxies such as M81, M82, M101, M108, M97, and M109. In mythology, it represents a bear chased by Orion or Callisto transformed by Zeus. Best observed in spring evenings, Ursa Major is iconic and serves as a key navigation aid, pointing toward the north celestial pole."
  },
  {
    "id": 84,
    "name": "Ursa Minor",
    "abbreviation": "UMi",
    "genitive": "Ursae Minoris",
    "type": "northern",
    "area_sq_deg": 256,
    "brightest_star": "Polaris",
    "brightest_star_magnitude": 1.98,
    "number_of_main_stars": 7,
    "number_of_stars_with_planets": 2,
    "messier_objects": [],
    "visible_latitude_range": "-20° to +90°",
    "best_visible_month": "June",
    "description": "Ursa Minor, the little bear, is a northern constellation containing the North Star, Polaris. Its brightest star, Polaris, has magnitude 1.98 and marks the north celestial pole. Ursa Minor contains few other notable stars and no Messier objects. Mythologically, it represents a bear following Ursa Major. Best viewed in spring and summer evenings, it is essential for celestial navigation and is easily recognized by the Little Dipper asterism."
  },
  {
    "id": 85,
    "name": "Vela",
    "abbreviation": "Vel",
    "genitive": "Velorum",
    "type": "southern",
    "area_sq_deg": 500,
    "brightest_star": "Gamma Velorum",
    "brightest_star_magnitude": 1.83,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 3,
    "messier_objects": ["NGC 2736"],
    "visible_latitude_range": "-90° to +40°",
    "best_visible_month": "March",
    "description": "Vela, the sails of the ship Argo, is a southern constellation and part of the former Argo Navis. Its brightest star, Gamma Velorum, is a multiple system with combined magnitude 1.83. Vela contains the Pencil Nebula (NGC 2736) and several open clusters. Representing the sails of the legendary ship, it is best observed in late summer to autumn evenings in the Southern Hemisphere. The constellation provides a rich field for deep-sky observation."
  },
  {
    "id": 86,
    "name": "Virgo",
    "abbreviation": "Vir",
    "genitive": "Virginis",
    "type": "northern",
    "area_sq_deg": 1294,
    "brightest_star": "Spica",
    "brightest_star_magnitude": 0.97,
    "number_of_main_stars": 9,
    "number_of_stars_with_planets": 12,
    "messier_objects": ["M49", "M58", "M59", "M60", "M61", "M84", "M86", "M87", "M89", "M90", "M104"],
    "visible_latitude_range": "-80° to +80°",
    "best_visible_month": "May",
    "description": "Virgo, the maiden, is a large northern zodiac constellation notable for its bright star Spica, magnitude 0.97. It contains many Messier galaxies, including M49, M58, M59, M60, M61, M84, M86, M87, M89, M90, and M104, forming the Virgo Cluster. In mythology, it represents a maiden associated with agriculture or justice. Best observed in spring evenings, Virgo’s extensive star field and numerous galaxies make it a favorite for deep-sky observers."
  },
  {
    "id": 87,
    "name": "Volans",
    "abbreviation": "Vol",
    "genitive": "Volantis",
    "type": "southern",
    "area_sq_deg": 141,
    "brightest_star": "Beta Volantis",
    "brightest_star_magnitude": 3.77,
    "number_of_main_stars": 4,
    "number_of_stars_with_planets": 0,
    "messier_objects": [],
    "visible_latitude_range": "-90° to +15°",
    "best_visible_month": "March",
    "description": "Volans, the flying fish, is a southern constellation introduced by Dutch navigators in the 16th century. Its brightest star, Beta Volantis, shines at magnitude 3.77. Volans contains few bright stars and no Messier objects. Representing a flying fish, it reflects the exploration of exotic southern fauna. Best observed in late summer evenings of the Southern Hemisphere, it is a faint constellation requiring dark skies for observation."
  },
  {
    "id": 88,
    "name": "Vulpecula",
    "abbreviation": "Vul",
    "genitive": "Vulpeculae",
    "type": "northern",
    "area_sq_deg": 268,
    "brightest_star": "Anser",
    "brightest_star_magnitude": 4.44,
    "number_of_main_stars": 6,
    "number_of_stars_with_planets": 1,
    "messier_objects": ["M27"],
    "visible_latitude_range": "-55° to +90°",
    "best_visible_month": "September",
    "description": "Vulpecula, the little fox, is a northern constellation located between Cygnus and Pegasus. Its brightest star, Anser, has magnitude 4.44. Vulpecula contains the Dumbbell Nebula (M27), a well-known planetary nebula. Mythologically, it represents a fox holding a goose. Best observed in late summer evenings, Vulpecula is subtle but notable for M27, making it popular among amateur astronomers with small telescopes."
  }
]






